In [2]:
import pandas as pd

In [7]:
titanic_raw_df = pd.read_csv('titanic.csv')
luistania_raw_df = pd.read_csv('lusitania.csv')

In [8]:
#titanic_raw_df.columns
luistania_raw_df.columns

Index([u'Family name', u'Title', u'Personal name', u'Fate', u'Age',
       u'Department/Class', u'Passenger/Crew', u'Citizenship', u'Position',
       u'Status', u'City', u'County', u'State', u'Country', u'Lifeboat',
       u'Rescue Vessel', u'Body No.', u'Ticket No.', u'Cabin No.',
       u'Traveling Companions and other notes', u'Value', u'Adult/Minor',
       u'Sex'],
      dtype='object')

In [5]:
titanic_raw_df.groupby(['sex','pclass']).mean()[['age','survived']]

                     age  survived
sex    pclass
female 1       37.037594  0.965278
       2       27.499223  0.886792
       3       22.185329  0.490741
male   1       41.029272  0.340782
       2       30.815380  0.146199
       3       25.962264  0.152130

In [12]:
luistania_raw_df.groupby(['Sex','Department/Class']).mean()

                                             Value
Sex    Department/Class
Female Saloon                             0.989011
       Second                             1.000000
       Third                              1.000000
       Victualling                        1.000000
Male   Band                               1.000000
       Deck                               1.000000
       Engineering                        1.000000
       Saloon                             1.000000
       Second                             1.000000
       Stowaway                           1.000000
       Third                              1.000000
       Third (Distressed British Seaman)  1.000000
       Victualling                        1.000000